#+AUTHOR:  Chris Zheng
#+EMAIL:   z@caudate.me
#+TITLE:  Ubuntu 20.04.1 Setup
#+OPTIONS: toc:nil
#+STARTUP: showall

** Runtimes

We start off by installing docker and all the standard runtimes


#+BEGIN_SRC bash :results output verbatim :cache no :tangle setup/ubuntu.sh
echo "Installing Runtimes"
apt install -y docker nodejs python3 luarocks cargo nim openjdk-11-jdk golang
#+END_SRC

#+RESULTS[989787536afbe4ee77b67aaeb575fc2e99a2df77]:
#+begin_example
Installing Runtimes
Reading package lists...
Building dependency tree...
Reading state information...
golang is already the newest version (2:1.13~1ubuntu2).
python3 is already the newest version (3.8.2-0ubuntu2).
docker is already the newest version (1.5-2).
luarocks is already the newest version (2.4.2+dfsg-1).
nim is already the newest version (1.0.6-1).
nodejs is already the newest version (10.19.0~dfsg-3ubuntu1).
openjdk-11-jdk is already the newest version (11.0.9.1+1-0ubuntu1~20.04).
cargo is already the newest version (0.44.1-0ubuntu1~20.04.1).
0 upgraded, 0 newly installed, 0 to remove and 36 not upgraded.
#+end_example

*** Generate a simple Dockerfile (Ubuntu bash) in the build directory
# C-c C-v t 
#+name: generate-dockerfile
#+BEGIN_SRC docker-build :exports code :padline no :tangle build/Dockerfile
FROM ubuntu
CMD bash
#+END_SRC


#+BEGIN_SRC docker-build :dir "./build" :push registry.tahto.im/foundation:0.0.1 :tag registry.tahto.im/foundation:0.0.1 :tangle 
FROM ubuntu:20.04
#+END_SRC

#+RESULTS:
: #<window 42 on *docker-push*>



